HIPHelper/WebContent/SOAP/SOAPRetrieveDocTemplate.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:ihe:iti:xds-b:2007">
	<soap:Header/>
	<soap:Body>
		<RetrieveDocumentSetRequest
			xsi:schemaLocation="urn:ihe:iti:xds-b:2007 file:/Users/bill/ihe/Frameworks/ITI-4/XDS.b/schema/IHE/XDS.b_DocumentRepository.xsd"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			xmlns="urn:ihe:iti:xds-b:2007">
			<DocumentRequest>
				<RepositoryUniqueId>1.3.6.1.4.1.21367.13.40.81</RepositoryUniqueId>
				<DocumentUniqueId>--DOC_ENTRY_ID--</DocumentUniqueId>
			</DocumentRequest>
		</RetrieveDocumentSetRequest>
	</soap:Body>
</soap:Envelope>